app/Controllers/Dashboard.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard',
            'j_peta' => $this->PetaModel->countAllResults(),
            'j_peta_upload' => $this->FileScanModel->countAllResults(),
            'j_digitasi' => $this->FileDigitasiModel->countDigitasi(),
---
SELECT COUNT(*) AS `numrows`
FROM `tb_digitasi`