app/Models/PetaModel.php

    public function get_peta($id = null)
    {
        return $this->db->table('tb_peta_scan')
            ->where('id_peta', $id)
            ->join('tb_image_scan', 'tb_peta_scan.id_peta=tb_image_scan.fk_peta', 'left')
            ->join('tb_digitasi', 'tb_peta_scan.id_peta=tb_digitasi.fk_peta', 'left')
            ->get()->getRow();
---
SELECT *
FROM `tb_peta_scan`
LEFT JOIN `tb_image_scan` ON `tb_peta_scan`.`id_peta`=`tb_image_scan`.`fk_peta`
LEFT JOIN `tb_digitasi` ON `tb_peta_scan`.`id_peta`=`tb_digitasi`.`fk_peta`
WHERE `id_peta` = '3874'

    public function get_all_peta()
    {
        return $this->db->table('tb_peta_scan')
            ->join('tb_image_scan', 'tb_peta_scan.id_peta=tb_image_scan.fk_peta', 'left')
            ->join('tb_digitasi', 'tb_peta_scan.id_peta=tb_digitasi.fk_peta', 'left')
            ->get()->getResult();
---
SELECT *
FROM `tb_peta_scan`
LEFT JOIN `tb_image_scan` ON `tb_peta_scan`.`id_peta`=`tb_image_scan`.`fk_peta`
LEFT JOIN `tb_digitasi` ON `tb_peta_scan`.`id_peta`=`tb_digitasi`.`fk_peta`